var syllables = [
					["ΚΙΑ","ΞΙ","ΒΕ","ΤΑΣ","ΕΚ","ΦΑ","ΑΝΕ","ΒΑΣ","ΕΝ","ΗΝ","ΑΜΕ","ΟΙ","ΣΑ","ΑΛΙ","ΤΕ","ΓΑΣ","ΑΛΟ","ΣΗ","ΙΑ","ΘΕ","ΕΛΟ","ΣΜΑ","ΟΛΑ","ΝΙ","ΠΑΝ","ΑΙ","ΓΑ","ΝΟ","ΓΕΙ","ΑΝ","ΕΙ","ΚΑΣ","ΚΑΝ","ΧΑ","ΧΟ","ΟΡΟ","ΡΗ","ΛΗ","ΠΗ","ΒΗ","ΨΑ","ΕΛΕ","ΟΛΟ","ΛΕ","ΕΙΣ","ΑΛΑ","ΝΙΑ","ΑΚΟ","ΖΑ","ΑΚΑ","ΖΙ","ΑΚΙ","ΣΙ","ΦΟ","ΑΝΙ","ΡΑ","ΠΑ","ΠΕΣ","ΑΖΙ","ΛΗΣ","ΙΚΑ","ΚΑ","ΕΛΙ","ΞΑ","ΦΙ","ΒΑ","ΔΕ","ΤΟ","ΣΑΝ","ΔΕΣ","ΤΑ","ΛΙ","ΔΗ","ΥΣ","ΣΕΙ","ΘΑ","ΔΑ","ΚΕ","ΚΗ","ΠΕ","ΠΑΙ","ΝΗ","ΚΕΣ","ΛΑ","ΕΛΑ","ΠΑΣ","ΔΙ","ΡΑΣ","ΜΑΝ","ΜΙ","ΑΜΑ","ΝΕ","ΤΗΣ","ΓΕ","ΣΕ","ΚΙ","ΝΑ","ΜΑ","ΤΙ","ΡΕ","ΜΕ","ΠΙ","ΡΑΝ","ΤΗ","ΤΙΑ","ΡΕΙ","ΑΔΕ","ΣΙΑ","ΓΗ","ΡΟ"],
					["ΑΡΑ","ΝΤΟ","ΣΥ","ΠΙΑ","ΤΟΥ","ΒΙ","ΕΡΙ","ΚΟ","ΛΟ","ΠΡΑ","ΕΞΕ","ΚΡΙ","ΨΙ","ΑΡΕ","ΕΠΑ","ΑΣΟ","ΣΤΗ","ΨΩ","ΘΥ","ΑΠΙ","ΞΟ","ΝΟΥ","ΠΥ","ΣΩ","ΦΥ","ΑΣΕ","ΕΡΟ","ΣΤΙ","ΙΚΟ","ΝΤΕ","ΡΩ","ΑΣ","ΝΟΣ","ΑΞΙ","ΒΟΣ","ΖΩ","ΟΥ","ΕΡ","ΑΠΟ","ΧΩ","ΑΤΙ","ΟΥ","ΡΟΣ","ΛΙΑ","ΑΡΙ","ΓΟ","ΝΤΙ","ΦΩ","ΟΣ","ΙΝΟ","ΠΟΣ","ΑΡ","ΕΣ","ΗΣ","ΑΣΑ","ΕΡΑ","ΧΡΗ","ΝΩ","ΚΥ","ΒΙΟ","ΑΠΕ","ΓΙ","ΘΡΑ","ΞΥ","ΖΟ","ΒΟ","ΤΡΑ","ΣΤΟ","ΤΣΑ","ΓΟΥ","ΑΝΟ","ΡΟ","ΕΠΙ","ΛΥ","ΡΙΑ","ΤΡΟ","ΜΙΑ","ΠΡΟ","ΠΩ","ΗΡΙ","ΜΠΑ","ΤΡΙ","ΠΑ","ΣΤΑ","ΚΡΑ","ΜΟΥ","ΣΤΕ","ΚΟΙ","ΑΡΟ","ΜΟ","ΛΩ","ΡΙ","ΔΟ","ΠΛΗ","ΤΣΙ","ΚΟΥ","ΠΟ","ΟΥΣ","ΜΥ","ΚΡΥ","ΚΟΣ","ΓΡΑ","ΓΩ","ΣΟ","ΣΥΝ","ΔΙΑ","ΔΙΟ","ΤΥ","ΑΤΟ","ΛΟΣ"]
				];

var thread = setTimeout("",0);



$( document ).ready(function() {

    $('.play-button').on('click',function(){
    	clearTimeout(thread);
    	$('.black').stop().fadeOut();
    	$('.syllable').addClass('hide', 300, "linear");
    	
        thread = setTimeout( function(){
    		$('.syllable').html(syllables[randomIntFromInterval(0,1)][randomIntFromInterval(0,108)]);
    		$('.syllable').removeClass('hide', 1000, "linear");
    	},350 );
    	
    	
    
    	var active = randomIntFromInterval(1,3);
    	$('.position').removeClass('active', 300 , "linear");
    	$('.p-'+active).addClass('active', 1000 , "linear");


    	var time = 1000 * randomIntFromInterval(10,40);

    	thread = setTimeout( function(){
    		$('.black').stop().fadeIn();
    	},time);

    });
});



function randomIntFromInterval(min,max) {
	return Math.floor(Math.random()*(max-min+1)+min);
}